
agh.homepage = http://www.agh.edu.pl
agh.name     = AGH

contact.address        = ul. Gramatyka 8a pok\u00F3j 414,<br/> +48 617 43 41,<br/> 30-071 Krak\u00F3w, Polska.
contact.bunker         = Nasz bunkier
contact.title          = Kontakt

contact_us.description = Je\u015Bli masz jakiekolwiek problem z us\u0142ug\u0105 rimrock prosz\u0119 daj nam zna\u0107!
contact_us.title       = Skontaktuj si\u0119 z nami

cyfronet.homepage = http://www.cyfronet.krakow.pl
cyfronet.name     = Cyfronet

dice.about.credo = Jeste\u015Bmy zespo\u0142em uczestnicz\u0105cym w wielu narodowych oraz mi\u0119dzynarodowych projektach badawczych, gdzie szukamy synergii mi\u0119dzy nauk\u0105 a rozwi\u0105zaniami komercyjnymi.
dice.about.title = O zespole DICE
dice.homepage    = http://dice.cyfronet.pl
dice.name        = Zesp\u00F3\u0142 DICE

example.code              = Kod
example.data_params       = Cia\u0142o \u017C\u0105dania
example.data_params.none  = Brak
example.error             = Wyst\u0105pienie b\u0142\u0119du
example.example           = Przyk\u0142ad
example.json              = JSON
example.method            = Metoda
example.notes             = Uwagi
example.notes.none        = Brak
example.sample            = Przyk\u0142adowe wywo\u0142anie
example.sample_call.title = Bash (z u\u017Cyciem komend base64, tr oraz curl)
example.success           = Odpowied\u017A
example.title             = Tytu\u0142
example.url               = URL
example.url_params        = Parametry zapytania
example.url_params.none   = Brak

iprocess.input.data_params       = {\n  "standard_input": [string (wymagane)]\n}
iprocess.input.title             = Nowe dane do procesu
iprocess.start.data_params       = {\n  "host": [string (wymagane)],\n  "command": [string (wymagane)]\n}
iprocess.start.title             = Uruchom nowy proces
iprocess.status.param.process_id = Identyfikator procesu
iprocess.status.title            = Pobierz status procesu
iprocess.statuses.title          = Pobierz statusy wszystkich proces\u00F3w

iprocesses.description = Zarz\u0105dzanie interaktywnymi procesami, pobieranie standardowego wyj\u015Bcia uruchomionej aplikacji oraz przesy\u0142anie nowych komend do aktywnej aplikacji przy u\u017Cyciu interfejsu RESTowego.\n
iprocesses.long_title  = Interaktywne uruchamianie komend
iprocesses.title       = Interaktywne procesy

jobs.abort.title                    = Informacje na temat zadania
jobs.delete.data_params             = Brak
jobs.delete.job_id                  = Identyfikator zadania
jobs.delete.notes                   = Brak
jobs.delete.title                   = Skasuj zadanie
jobs.description                    = Zrz\u0105dzanie zadaniami przy u\u017Cyciu interfejsu RESTowego, kt\u00F3ry pozwala uruchomi\u0107 nowe zadanie u\u017Cywaj\u0105c qsub, monitorowa\u0107 ich status, pobiera\u0107 wyprodukowane rezultaty, b\u0105d\u017A te\u017C zatrzymywa\u0107 (kasowa\u0107) uruchomione/sko\u0144czone zadania.
jobs.get.data_params                = Brak
jobs.get.job_id                     = Identyfikator zadania
jobs.get.notes                      = Brak
jobs.get.title                      = Szczeg\u00F3\u0142y zadania
jobs.get_all.data_params            = Brak
jobs.get_all.notes                  = Brak
jobs.get_all.title                  = Szczeg\u00F3\u0142y wszystkich zleconych zada\u0144
jobs.get_all.url_params             = Brak
jobs.long_title                     = Zlecanie zda\u0144 na infrastruktur\u0119
jobs.post.data_params               = {\n  "host": [string (wymagane)],\n  "working_directory": [string (opcjonalne)],\n  "script": [string (wymagane)]\n}
jobs.post.notes                     = Brak
jobs.post.title                     = Zle\u0107 nowe zadanie
jobs.post.working_directory.warning = <strong>Uwaga!</strong> Domy\u015Blnie warto\u015B\u0107 <tt>working_directory</tt> jest ustawiana na katalog domowy u\u017Cytkownika. W rezultacie, je\u015Bli dwa lub wi\u0119cej zada\u0144 zostanie uruchomionych z domy\u015Blna warto\u015Bci\u0105 zmiennej <tt>working_directory</tt> wtedy warto\u015B\u0107 skryptu zadania zostanie nadpisana.
jobs.put.action_params              = {\n  "action": [string (wymagane)]\n}
jobs.title                          = Zadania

links = Nasze linki

processes.description         = Uruchamianie pojedynczej komendy na zdalnej maszynie. Rezultatem wywo\u0142ania jest kod zwracany przez aplikacj\u0119 oraz jej standardowe wyj\u015Bcie. Limit czasu uruchomienia pojedynczej komendy zosta\u0142 ograniczony do 2000 mili sekund.
processes.example.data_params = {\n  "host": [string (wymagane)],\n  "command": [string (wymagane)]\n}
processes.example.notes       = Brak
processes.example.title       = Wykonaj polecenie
processes.example.url_params  = Brak
processes.long_title          = Wywo\u0142anie komendy na zdalnej maszynie
processes.title               = Procesy

proxyinfo.about = <strong>Uwaga!</strong> Wszystkie przedstawione poni\u017Cej operacje s\u0105 zabezpieczone. W celu autoryzacji wymagane jest dodanie nag\u0142\u00F3wka z nazw\u0105 <code>PROXY</code> oraz warto\u015Bci\u0105 certyfikatu proxy zakodowanego przy u\u017Cyciu Base64 (wpierany jest jedynie certyfikat proxy podpisany przez SimpleCA).

rimrock.description = Rimrock u\u0142atwia spos\u00F3b w jakim jeste\u015B w stanie uruchamia\u0107 komendy/zadania na zdalnej maszynie. Mo\u017Cliwe jest to dzi\u0119ki dostarczeniu prostego interfejsu RESTowego, kt\u00F3ry przykrywa z\u0142o\u017Cono\u015B\u0107 zwi\u0105zan\u0105 z logowaniem na infrastruktur\u0119 orach uruchamianiem zdalnych zada\u0144. Rimrock dostarcza trzy tryby pracy. Dzi\u0119ki pierwszemu trybowi b\u0119dziesz w stanie uruchomi\u0107 komend\u0119 na zdalnej maszynie w trybie wsadowym. Drugi tryb umo\u017Cliwia uruchomienie interaktywnej aplikacji, gdzie dzi\u0119ki wywo\u0142aniom RESTowym jeste\u015B w stanie pobra\u0107 aktualne dane wyj\u015Bciowe aplikacji oraz poda\u0107 nowe dane wej\u015Bciowe. Ostatni ze wspomnianych tryb\u00F3w umo\u017Cliwia uruchomienie zdalnych zda\u0144, kt\u00F3re b\u0119d\u0105 mog\u0142y by\u0107 uruchomione na klastrze obliczeniowym. Nie musisz si\u0119\u00A0martwi\u0107 o opis zadania (zgodnego z JDI) - po prostu prze\u015Blij nam skrypt, kt\u00F3ry chcesz uruchomi\u0107 a my zajmiemy si\u0119 reszta.
rimrock.long_name   = Uniwersalny kontroler zdalnych zada\u0144
rimrock.name        = rimrock

team.dh.bio = Uzyska\u0142em stopie\u0144 magistra in\u017Cyniera Informatyki na Akademii G\u00F3rniczo-Hutniczej w Krakowie. W trakcie mojej pracy w Cyfronecie uczestnicz\u0119 w projektach narodowych jak i mi\u0119dzynarodowych, gdzie moje zainteresowania badawcze skupiaj\u0105 si\u0119 na wykorzystaniu rozproszonych \u015Brodowisk obliczeniowych. Moje g\u0142\u00F3wne zainteresowania skupiaj\u0105c si\u0119 na dostarczaniu nowoczesnych rozwi\u0105za\u0144 Webowych, j\u0119zyk\u00F3w dynamicznych oraz umo\u017Cliwiania dost\u0119pu u\u017Cytkownikom do zdalnych zasob\u00F3w wizualizacyjnych.
team.mk.bio = Uko\u0144czy\u0142em studia na Akademii G\u00F3rniczo-Hutniczej w Krakowie, gdzie uzyska\u0142em tytu\u0142 magistra in\u017Cyniera. W roku 2005 zacz\u0105\u0142em swoj\u0105 karier\u0119 zawodow\u0105 b\u0119d\u0105c cz\u0142onkiem zespo\u0142u badawczego zajmuj\u0105cego si\u0119 dostarczaniem rozwi\u0105za\u0144 tele-informatycznych oraz narz\u0119dzi modeluj\u0105cych w firmie Comarch (2005-2010). W roku 2006 do\u0142\u0105czy\u0142em do zespo\u0142u DICE, gdzie uczestnicz\u0119 w realizacji narodowych jak i mi\u0119dzynarodowych projekt\u00F3w badawczych. Moje aktualne zainteresowania badawcze obejmuj\u0105 odkrywanie oraz wykorzystanie rozproszonych zasob\u00F3w obliczeniowych oraz tworzenie aplikacji wykorzystuj\u0105cych technologie chmury obliczeniowej. 
team.mp.bio = Programista naukowy w ACK Cyfronet AGH. Uczestnik projekt\u00F3w mi\u0119dzynarodowych i polskich, szczeg\u00F3lnie zaanga\u017Cowany w prace nad systemami workflowowymi, infrastrukturami clodowymi i aplikacjami wieloskalowymi.
team.title  = Zesp\u00F3\u0142
